apex-creator/berkut/MMwaveL/MMWAVE_L_SDK_05_05_04_02/examples/drivers/lin/lin_external_responder_interrupts/xwrL64xx-aop/m4fss0-0_nortos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "XWRL64XX" --package "AOP" --part "Default" --context "m4fss0-0" --product "MMWAVE-L-SDK@05.00.00"
 * @versions {"tool":"1.17.0+3128"}
 */

/**
 * Import the modules used in this configuration.
 */
const lin        = scripting.addModule("/drivers/lin/lin", {}, false);
const lin1       = lin.addInstance();
const debug_log  = scripting.addModule("/kernel/dpl/debug_log");
const mpu_armv7  = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71 = mpu_armv7.addInstance();
const mpu_armv72 = mpu_armv7.addInstance();
const mpu_armv73 = mpu_armv7.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
lin1.$name                  = "CONFIG_LIN1";
lin1.useDefault             = false;
lin1.linMode                = "LIN_MODE_LIN_RESPONDER";
lin1.enableInterrupt        = true;
lin1.interruptLine          = ["LIN_INTERRUPT_LINE0","LIN_INTERRUPT_LINE1"];
lin1.linMsgFilter           = "LIN_MSG_FILTER_IDRESPONDER";
lin1.enableParityCheck      = false;
lin1.interruptPriorityLine0 = [" LIN_INT_ID"," LIN_INT_RX"," LIN_INT_TX"," LIN_INT_WAKEUP"];
lin1.interruptPriorityLine1 = [" LIN_INT_BE"," LIN_INT_CE"," LIN_INT_FE"," LIN_INT_ISFE"," LIN_INT_NRE"," LIN_INT_OE"," LIN_INT_PE"];
lin1.interruptFlags         = [" LIN_INT_BE"," LIN_INT_CE"," LIN_INT_FE"," LIN_INT_ID"," LIN_INT_ISFE"," LIN_INT_NRE"," LIN_INT_OE"," LIN_INT_PBE"," LIN_INT_PE"," LIN_INT_RX"," LIN_INT_TX"," LIN_INT_WAKEUP"];
lin1.LIN.$assign            = "LIN0";
lin1.LIN.RX.$assign         = "PAD_AL";
lin1.LIN.TX.$assign         = "PAD_AK";

debug_log.enableUartLog           = true;
debug_log.uartLog.$name           = "CONFIG_UART0";
debug_log.uartLog.UART.RX.$assign = "PAD_AP";
debug_log.uartLog.UART.TX.$assign = "PAD_AO";

const edma                         = scripting.addModule("/drivers/edma/edma", {}, false);
const edma1                        = edma.addInstance({}, false);
edma1.$name                        = "CONFIG_EDMA0";
debug_log.uartLog.edmaConfig       = edma1;
edma1.edmaRmDmaCh[0].$name         = "CONFIG_EDMA_RM0";
edma1.edmaRmQdmaCh[0].$name        = "CONFIG_EDMA_RM1";
edma1.edmaRmTcc[0].$name           = "CONFIG_EDMA_RM2";
edma1.edmaRmParam[0].$name         = "CONFIG_EDMA_RM3";
edma1.edmaRmReservedDmaCh[0].$name = "CONFIG_EDMA_RM4";

mpu_armv71.$name        = "CONFIG_MPU_REGION0";
mpu_armv71.attributes   = "Device";
mpu_armv71.allowExecute = false;

mpu_armv72.$name    = "CONFIG_MPU_REGION1";
mpu_armv72.baseAddr = 0x400000;
mpu_armv72.size     = 19;

mpu_armv73.$name    = "CONFIG_MPU_REGION2";
mpu_armv73.baseAddr = 0x22400000;
mpu_armv73.size     = 19;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
debug_log.uartLog.UART.$suggestSolution = "UARTB";
